In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

%load_ext rpy2.ipython

In [7]:
import pandas as pd
from numpy import NaN

In [4]:
%%R
library(dplyr)

## How to drop rows of Pandas DataFrame whose value in certain columns is NaN

https://stackoverflow.com/questions/13413590/how-to-drop-rows-of-pandas-dataframe-whose-value-in-certain-columns-is-nan

In [31]:
df = pd.DataFrame({
    'A': [11,  22,  33,  44,  55,  66],
    'B': [NaN, NaN, 4.3, NaN, 2.5, NaN],
    'C': [NaN, 12,  NaN, NaN, 8,   NaN],
})

df

    A    B     C
0  11  NaN   NaN
1  22  NaN  12.0
2  33  4.3   NaN
3  44  NaN   NaN
4  55  2.5   8.0
5  66  NaN   NaN

In [32]:
%%R

df <- data_frame(
    A = c(11,  22,  33,  44,  55,  66),
    B = c(NA, NA, 4.3, NA, 2.5, NA),
    C = c(NA, 12,  NA, NA, 8,   NA)
)

df

# A tibble: 6 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    11    NA    NA
2    22    NA    12
3    33   4.3    NA
4    44    NA    NA
5    55   2.5     8
6    66    NA    NA

In [33]:
df.dropna(subset = ['B'])

    A    B    C
2  33  4.3  NaN
4  55  2.5  8.0

In [42]:
%%R
df %>% filter(!is.na(B))

# A tibble: 2 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    33   4.3    NA
2    55   2.5     8

In [36]:
df.dropna(subset = ['B', 'C'])

    A    B    C
4  55  2.5  8.0

In [38]:
%%R
df %>% filter(!is.na(B) & !is.na(C))

# A tibble: 1 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    55   2.5     8

In [39]:
df.dropna(subset = ['B', 'C'], how='all')

    A    B     C
1  22  NaN  12.0
2  33  4.3   NaN
4  55  2.5   8.0

In [41]:
%%R
df %>% filter(!is.na(B) | !is.na(C))

# A tibble: 3 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    22    NA    12
2    33   4.3    NA
3    55   2.5     8

In [44]:
df[df['B'].notna()]

    A    B    C
2  33  4.3  NaN
4  55  2.5  8.0

In [54]:
%%R
df[!is.na(df$B),]

# A tibble: 2 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    33   4.3    NA
2    55   2.5     8

In [50]:
df[df['B'].notna() & df['C'].notna()]

    A    B    C
4  55  2.5  8.0

In [55]:
%%R
df[!is.na(df$B) & !is.na(df$C),]

# A tibble: 1 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    55   2.5     8

In [51]:
df[df['B'].notna() | df['C'].notna()]

    A    B     C
1  22  NaN  12.0
2  33  4.3   NaN
4  55  2.5   8.0

In [56]:
%%R
df[!is.na(df$B) | !is.na(df$C),]

# A tibble: 3 x 3
      A     B     C
  <dbl> <dbl> <dbl>
1    22    NA    12
2    33   4.3    NA
3    55   2.5     8